In [2]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
from config import login

In [3]:
# Loading csv files

links = pd.read_csv("movies_csv/links.csv")
movies = pd.read_csv("movies_csv/movies.csv")
ratings = pd.read_csv("movies_csv/ratings.csv")
tags = pd.read_csv("movies_csv/tags.csv")

In [4]:
# Establishing connection
# Make sure to manually create "movies_db" in postgres 

db_url = 'postgresql://' + login + '@localhost:5432/movie_db'
engine = create_engine(db_url)
connection = engine.connect()

In [5]:
links = links.rename(columns={"movieId": "movie_id"})
movies = movies.rename(columns={"movieId": "movie_id", "genres": "genre"})
ratings = ratings.rename(columns={"movieId": "movie_id", "userId": "user_id"})
tags = tags.rename(columns={"movieId": "movie_id", "userId": "user_id"})

In [6]:
# Adding csv's to postgres

links.to_sql("links", engine, if_exists='append', index=False)
movies.to_sql("movies", engine, if_exists='append', index=False)
ratings.to_sql("ratings", engine, if_exists='append', index=False)
tags.to_sql("tags", engine, if_exists='append', index=False)

In [7]:
# Make sure to close the connection

connection.close()

In [25]:
# Example queries

      user_id  movie_id               tag   timestamp
0           2     60756             funny  1445714994
1           2     60756   Highly quotable  1445714996
2           2     60756      will ferrell  1445714992
3           2     89774      Boxing story  1445715207
4           2     89774               MMA  1445715200
...       ...       ...               ...         ...
3678      606      7382         for katie  1171234019
3679      606      7936           austere  1173392334
3680      610      3265            gun fu  1493843984
3681      610      3265  heroic bloodshed  1493843978
3682      610    168248  Heroic Bloodshed  1493844270

[3683 rows x 4 columns]